
<img src="https://raw.githubusercontent.com/dataitgirls2/10minutes2pandas/master/_layouts/og_image_trsp.png" width="60%">

>[Pandas 10분 완성](https://dataitgirls2.github.io/10minutes2pandas/)
> 1. Object Creation (객체 생성)
> 2. Viewing Data (데이터 확인하기)
> 3. Selection (선택)
> 4. Missing Data (결측치)
> 5. Operation (연산)
> 6. Merge (병합)
> 7. Grouping (그룹화)
> 8. Reshaping (변형)
> 9. Time Series (시계열)
> 10. Categoricals (범주화)
> 11. Plotting (그래프)
> 12. Getting Data In / Out (데이터 입 / 출력)
> 13. Gotchas (잡았다!)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation (객체 생성)
> *[데이터 구조 소개 섹션](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html) 을 참조*</br>
>
>Pandas는 값을 가지고 있는 리스트를 통해 Series를 만들고, 정수로 만들어진 인덱스를 기본값으로 불러올 것입니다.

In [2]:
s = pd.Series([1, 3, 5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

>datetime 인덱스와 레이블이 있는 열을 가지고 있는 numpy 배열을 전달하여 데이터프레임을 만듭니다.

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.527480 -0.069577  0.166533 -0.790439
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327
2013-01-05 -0.908060 -1.446254 -0.469889 -0.818744
2013-01-06  0.580601  1.203378 -0.131766 -0.150433

> Series와 같은 것으로 변환될 수 있는 객체들의 dict로 구성된 데이터프레임을 만듭니다.

In [5]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D' : np.array([3]  * 4, dtype='int32'),
                    'E' : pd.Categorical(['test', 'train', 'test', 'train']),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data (데이터 확인하기)
>[Basic Section](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html)을 참조

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.527480 -0.069577  0.166533 -0.790439
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327
2013-01-05 -0.908060 -1.446254 -0.469889 -0.818744

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327
2013-01-05 -0.908060 -1.446254 -0.469889 -0.818744
2013-01-06  0.580601  1.203378 -0.131766 -0.150433

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[ 0.52748016, -0.06957669,  0.1665333 , -0.79043877],
       [-0.49372101,  0.83921462,  0.09130826, -0.61383652],
       [-0.27928022,  1.71424901,  1.44395156, -1.00953082],
       [ 1.07722915, -1.84789547, -0.11353632, -0.78732746],
       [-0.90805977, -1.44625358, -0.46988888, -0.81874433],
       [ 0.58060119,  1.20337835, -0.1317655 , -0.15043303]])

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.084042  0.065519  0.164434 -0.695052
std    0.758908  1.454407  0.664813  0.294963
min   -0.908060 -1.847895 -0.469889 -1.009531
25%   -0.440111 -1.102084 -0.127208 -0.811668
50%    0.124100  0.384819 -0.011114 -0.788883
75%    0.567321  1.112337  0.147727 -0.657209
max    1.077229  1.714249  1.443952 -0.150433

> 행 과 열 전치.

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.527480   -0.493721   -0.279280    1.077229   -0.908060    0.580601
B   -0.069577    0.839215    1.714249   -1.847895   -1.446254    1.203378
C    0.166533    0.091308    1.443952   -0.113536   -0.469889   -0.131766
D   -0.790439   -0.613837   -1.009531   -0.787327   -0.818744   -0.150433

> 축 별 정렬

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.790439  0.166533 -0.069577  0.527480
2013-01-02 -0.613837  0.091308  0.839215 -0.493721
2013-01-03 -1.009531  1.443952  1.714249 -0.279280
2013-01-04 -0.787327 -0.113536 -1.847895  1.077229
2013-01-05 -0.818744 -0.469889 -1.446254 -0.908060
2013-01-06 -0.150433 -0.131766  1.203378  0.580601

> 값 별 정렬

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327
2013-01-05 -0.908060 -1.446254 -0.469889 -0.818744
2013-01-01  0.527480 -0.069577  0.166533 -0.790439
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-06  0.580601  1.203378 -0.131766 -0.150433
2013-01-03 -0.279280  1.714249  1.443952 -1.009531

## Selection (선택)
> 주석 (Note) : 선택과 설정을 위한 Python / Numpy의 표준화된 표현들이 직관적

> 코드 작성을 위한 양방향 작업에 유용하지만 Pandas에 최적화된 데이터 접근 방법인 <u>"*.at, .iat, .loc 및 .iloc*"</u> 을 추천
>
> *[데이터 인덱싱 및 선택](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html) 문서와 [다중 인덱싱 / 심화 인덱싱 문서](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html)를 참조*
### Getting (데이터 얻기)
> df.A 와 동일한 Series를 생성하는 단일의 열 선택

In [16]:
df['A']

2013-01-01    0.527480
2013-01-02   -0.493721
2013-01-03   -0.279280
2013-01-04    1.077229
2013-01-05   -0.908060
2013-01-06    0.580601
Freq: D, Name: A, dtype: float64

> row indexing

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  0.527480 -0.069577  0.166533 -0.790439
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327

### Selection by Label (Label 을 통한 선택) loc[]
> *[Label을 통한 선택](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html) 참조*
>
> loc indexing (dates는 위에서 row 인덱스로 지정)

In [19]:
df.loc[dates[0]]

A    0.527480
B   -0.069577
C    0.166533
D   -0.790439
Name: 2013-01-01 00:00:00, dtype: float64

> loc 라벨을 사용하여 다중 column 가져오기

In [20]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.527480 -0.069577
2013-01-02 -0.493721  0.839215
2013-01-03 -0.279280  1.714249
2013-01-04  1.077229 -1.847895
2013-01-05 -0.908060 -1.446254
2013-01-06  0.580601  1.203378

> row 는 인덱싱 column 은 지정하는 형식 (test. 2번째줄의 결과는 같다.)

In [21]:
df.loc['20130102' : '20130104', ['A', 'B']]
# df.loc['20130102' : '20130104', 'A' : 'B']

                   A         B
2013-01-02 -0.493721  0.839215
2013-01-03 -0.279280  1.714249
2013-01-04  1.077229 -1.847895

> 반환되는 객체의 차원를 줄입니다. (type = pandas.core.series.Series)

In [22]:
df.loc['20130102',['A','B']]

A   -0.493721
B    0.839215
Name: 2013-01-02 00:00:00, dtype: float64

> 특정 행열의 스칼라 값을 가져온다.

In [23]:
df.loc[dates[0],'A']

0.5274801617588412

> 스칼라 값만 가져오는 방법 (loc와 비슷함, <u>"*at*"</u> if you only need to get or set a single value in a DataFrame
or Series.)

In [24]:
df.at[dates[0], 'A']
# df.at?

0.5274801617588412

### Selection by Position (위치로 선택하기) iloc[]
> *자세한 내용은 [위치로 선택하기](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)를 참고* </br>
>
> index로 위치 선택

In [25]:
df.iloc[3]

A    1.077229
B   -1.847895
C   -0.113536
D   -0.787327
Name: 2013-01-04 00:00:00, dtype: float64

> numpy / python과 유사하게 slicing

In [26]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.077229 -1.847895
2013-01-05 -0.908060 -1.446254

> 리스트형태로 원하는 행과 열만 뽑니다. (numpy / python의 스타일)

In [27]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.493721  0.091308
2013-01-03 -0.279280  1.443952
2013-01-05 -0.908060 -0.469889

> 명시적으로 행으로 나누기

In [28]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.493721  0.839215  0.091308 -0.613837
2013-01-03 -0.279280  1.714249  1.443952 -1.009531

> 명시적으로 열로 나누기

In [29]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.069577  0.166533
2013-01-02  0.839215  0.091308
2013-01-03  1.714249  1.443952
2013-01-04 -1.847895 -0.113536
2013-01-05 -1.446254 -0.469889
2013-01-06  1.203378 -0.131766

> 명시적으로 특정(스칼라) 값을 얻을때

In [30]:
df.iloc[1,1]

0.8392146169572972

> 스칼라 값을 빠르게 얻는 방법입니다 (위의 방식과 동일합니다).

In [31]:
df.iat[1,1]

0.8392146169572972

### Boolean Indexing
>데이터를 선택하기 위해 특정 열의 값을 기준으로 사용

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.527480 -0.069577  0.166533 -0.790439
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327
2013-01-06  0.580601  1.203378 -0.131766 -0.150433

> Boolean 조건을 충족하는 DataFrame 에서 값을 선택

In [33]:
df[df > 0]

                   A         B         C   D
2013-01-01  0.527480       NaN  0.166533 NaN
2013-01-02       NaN  0.839215  0.091308 NaN
2013-01-03       NaN  1.714249  1.443952 NaN
2013-01-04  1.077229       NaN       NaN NaN
2013-01-05       NaN       NaN       NaN NaN
2013-01-06  0.580601  1.203378       NaN NaN

> isin() 필터링을 위한 메소드

In [34]:
df2 = df.copy()

In [35]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.527480 -0.069577  0.166533 -0.790439    one
2013-01-02 -0.493721  0.839215  0.091308 -0.613837    one
2013-01-03 -0.279280  1.714249  1.443952 -1.009531    two
2013-01-04  1.077229 -1.847895 -0.113536 -0.787327  three
2013-01-05 -0.908060 -1.446254 -0.469889 -0.818744   four
2013-01-06  0.580601  1.203378 -0.131766 -0.150433  three

In [36]:
df2[df2['E'].isin(['two', 'four'])]

                  A         B         C         D     E
2013-01-03 -0.27928  1.714249  1.443952 -1.009531   two
2013-01-05 -0.90806 -1.446254 -0.469889 -0.818744  four

### Setting (설정)
> 새 열을 설정하면 데이터가 인덱스 별로 자동 정렬

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['f'] = s1

> 라벨로 값 설정 (0 행 A 열 값을 0으로)

In [39]:
df.at[dates[0], 'A'] = 0

> 위치로 값 설정

In [40]:
df.iat[0, 1] = 0

> Numpy 배열을 사용하여 값 설정

In [41]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    f
2013-01-01  0.000000  0.000000  0.166533  5  NaN
2013-01-02 -0.493721  0.839215  0.091308  5  1.0
2013-01-03 -0.279280  1.714249  1.443952  5  2.0
2013-01-04  1.077229 -1.847895 -0.113536  5  3.0
2013-01-05 -0.908060 -1.446254 -0.469889  5  4.0
2013-01-06  0.580601  1.203378 -0.131766  5  5.0

> where 연산을 설정

In [42]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    f
2013-01-01  0.000000  0.000000 -0.166533 -5  NaN
2013-01-02 -0.493721 -0.839215 -0.091308 -5 -1.0
2013-01-03 -0.279280 -1.714249 -1.443952 -5 -2.0
2013-01-04 -1.077229 -1.847895 -0.113536 -5 -3.0
2013-01-05 -0.908060 -1.446254 -0.469889 -5 -4.0
2013-01-06 -0.580601 -1.203378 -0.131766 -5 -5.0

## Missing Data (결측치)
> Pandas는 결측치를 표현하기 위해 주로 np.nan 값을 사용
>
> 이 방법은 기본 설정값이지만 계산에는 포함되지 않는다. [Missing data section](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html)을 참조
>
>Reindexing으로 지정된 축 상의 인덱스를 변경 / 추가 / 삭제 할 수 있다.
>
>Reindexing은 데이터의 복사본을 반환

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [44]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [45]:
df1

                   A         B         C  D    f    E
2013-01-01  0.000000  0.000000  0.166533  5  NaN  1.0
2013-01-02 -0.493721  0.839215  0.091308  5  1.0  1.0
2013-01-03 -0.279280  1.714249  1.443952  5  2.0  NaN
2013-01-04  1.077229 -1.847895 -0.113536  5  3.0  NaN

> 결측치를 가지고 있는 행 삭제

In [46]:
df1.dropna(how='any')

                   A         B         C  D    f    E
2013-01-02 -0.493721  0.839215  0.091308  5  1.0  1.0

> 결측치 채워넣기

In [47]:
df1.fillna(value=5)

                   A         B         C  D    f    E
2013-01-01  0.000000  0.000000  0.166533  5  5.0  1.0
2013-01-02 -0.493721  0.839215  0.091308  5  1.0  1.0
2013-01-03 -0.279280  1.714249  1.443952  5  2.0  5.0
2013-01-04  1.077229 -1.847895 -0.113536  5  3.0  5.0

> NaN 값을 boolean을 통해 표시
>
> <u>"*isna()*"</u> 값이 있는 데이터는 False, NAN인 값은 True 로 표시

In [48]:
pd.isna(df1)

                A      B      C      D      f      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operation (연산)

> [이진 (Binary) 연산의 기본섹션](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html) 참조
### Stats (통계)
> 일반적으로 결측치를 제외한 후 연산
> 기술통계를 수행한다.
>
> <u>"*mean()*"</u> 기본은 columns

In [49]:
df.mean()

A   -0.003872
B    0.077115
C    0.164434
D    5.000000
f    3.000000
dtype: float64

> rows axes

In [50]:
df.mean(1)

2013-01-01    1.291633
2013-01-02    1.287360
2013-01-03    1.975784
2013-01-04    1.423159
2013-01-05    1.235160
2013-01-06    2.330443
Freq: D, dtype: float64

정렬이 필요하며, 차원이 다른 객체로 연산해보겠습니다.

또한, pandas는 지정된 차원을 따라 자동으로 브로드 캐스팅됩니다.

역자 주 : broadcast란 numpy에서 유래한 용어로, n차원이나 스칼라 값으로 연산을 수행할 때 도출되는 결과의 규칙을 설명하는 것을 의미

shift???? </br>
sub????

In [51]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [52]:
df.sub(s, axis='index')

                   A         B         C    D    f
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.279280  0.714249  0.443952  4.0  1.0
2013-01-04 -1.922771 -4.847895 -3.113536  2.0  0.0
2013-01-05 -5.908060 -6.446254 -5.469889  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply (적용)
> 데이터에 함수를 적용

In [53]:
df.apply(np.cumsum)

                   A         B         C   D     f
2013-01-01  0.000000  0.000000  0.166533   5   NaN
2013-01-02 -0.493721  0.839215  0.257842  10   1.0
2013-01-03 -0.773001  2.553464  1.701793  15   3.0
2013-01-04  0.304228  0.705568  1.588257  20   6.0
2013-01-05 -0.603832 -0.740685  1.118368  25  10.0
2013-01-06 -0.023231  0.462693  0.986602  30  15.0

In [54]:
df.apply(lambda x: x.max() - x.min())

A    1.985289
B    3.562144
C    1.913840
D    0.000000
f    4.000000
dtype: float64

### Histogramming (히스토그래밍)
> [Histogramming and Discretization (히스토그래밍과 이산화)](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html) 참조

In [55]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [56]:
s

0    1
1    5
2    5
3    5
4    1
5    0
6    4
7    4
8    3
9    5
dtype: int32

In [57]:
s.value_counts()

5    4
1    2
4    2
0    1
3    1
dtype: int64

### String Methods (문자열 메소드)
>Series는 문자열 처리 메소드 모음 (set)을 가지고 있다.
>
>이 모음은 배열의 각 요소를 쉽게 조작할 수 있도록 만들어주는 문자열의 속성에 포함되어 있습니다.
>
>문자열의 패턴 일치 확인은 기본적으로 정규 표현식을 사용, 몇몇의 경우 항상 정규 표현식을 사용함에 유의.

>좀 더 자세한 내용은 [벡터화된 문자열 메소드](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html) 부분에서 확인할 수 있습니다.

In [58]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'caba', 'dog', 'cat'])

In [59]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge (병합)
### Concat (연결)
>결합 (join) / 병합 (merge) 형태의 연산에 대한 인덱스, 관계 대수 기능을 위한 다양한 형태의 논리를 포함한 <u>Series, DataFrame, Panel</u> 객체를 손쉽게 결합할 수 있도록 하는 다양한 기능을 pandas 에서 제공
>
>[Merging](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html) 참조.
>
>[concat()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html)으로 pandas 객체를 연결.

In [60]:
df = pd.DataFrame(np.random.randn(10, 4))

In [61]:
df

          0         1         2         3
0  2.121714 -0.684348 -0.276672  1.762908
1 -1.007798 -0.415541  0.173581  0.746572
2  1.448808 -0.427463  0.265836  2.381259
3  0.238082 -0.775639 -0.732974 -1.788940
4 -0.213462 -0.279259  0.332355  0.483950
5 -0.209118  0.626450  0.651353  0.811424
6 -0.825562  1.469172  0.749848  0.054429
7  1.885103 -1.134060 -0.332322  2.807268
8  0.119370  0.538574  1.096070  0.767154
9  0.752750 -0.700863  0.753239  1.868538

In [62]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  2.121714 -0.684348 -0.276672  1.762908
 1 -1.007798 -0.415541  0.173581  0.746572
 2  1.448808 -0.427463  0.265836  2.381259,
           0         1         2         3
 3  0.238082 -0.775639 -0.732974 -1.788940
 4 -0.213462 -0.279259  0.332355  0.483950
 5 -0.209118  0.626450  0.651353  0.811424
 6 -0.825562  1.469172  0.749848  0.054429,
           0         1         2         3
 7  1.885103 -1.134060 -0.332322  2.807268
 8  0.119370  0.538574  1.096070  0.767154
 9  0.752750 -0.700863  0.753239  1.868538]

In [63]:
pd.concat(pieces)

          0         1         2         3
0  2.121714 -0.684348 -0.276672  1.762908
1 -1.007798 -0.415541  0.173581  0.746572
2  1.448808 -0.427463  0.265836  2.381259
3  0.238082 -0.775639 -0.732974 -1.788940
4 -0.213462 -0.279259  0.332355  0.483950
5 -0.209118  0.626450  0.651353  0.811424
6 -0.825562  1.469172  0.749848  0.054429
7  1.885103 -1.134060 -0.332322  2.807268
8  0.119370  0.538574  1.096070  0.767154
9  0.752750 -0.700863  0.753239  1.868538

### join (결합)
> <u>"*SQL*"</u> 방식으로 병합. [데이터베이스 스타일 결합](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html) 참고.

In [64]:
left = pd.DataFrame({'key' : ['foo', 'foo'], 'lval' : [1, 2]})
right = pd.DataFrame({'key' : ['foo', 'foo'], 'rval' : [4, 5]})

In [65]:
left

   key  lval
0  foo     1
1  foo     2

In [66]:
right

   key  rval
0  foo     4
1  foo     5

In [67]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

> 다른 ex)

In [68]:
left = pd.DataFrame({'key' : ['foo', 'bar'], 'lval' : [1, 2]})
right = pd.DataFrame({'key' : ['foo', 'bar'], 'rval' : [4, 5]})

In [69]:
left

   key  lval
0  foo     1
1  bar     2

In [70]:
right

   key  rval
0  foo     4
1  bar     5

In [71]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append (추가)
> 데이터프레임에 행을 추가합니다. [Appending](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html) 참조.

In [72]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])

In [73]:
df

          A         B         C         D
0 -0.591336  0.142663  0.810928  0.464657
1 -1.109802  1.378715 -0.561217  0.788887
2  0.875935  1.115383  0.230977 -0.354941
3 -0.194991  1.085396 -0.631690  0.400845
4 -0.558928  0.937520  0.712567  0.807413
5  0.069467  2.634905 -2.115203 -0.077287
6  0.624982  1.478238 -1.694714  0.352130
7 -0.604516  0.825739  0.123350 -0.549913

In [74]:
s = df.loc[3]
s

A   -0.194991
B    1.085396
C   -0.631690
D    0.400845
Name: 3, dtype: float64

In [75]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.591336  0.142663  0.810928  0.464657
1 -1.109802  1.378715 -0.561217  0.788887
2  0.875935  1.115383  0.230977 -0.354941
3 -0.194991  1.085396 -0.631690  0.400845
4 -0.558928  0.937520  0.712567  0.807413
5  0.069467  2.634905 -2.115203 -0.077287
6  0.624982  1.478238 -1.694714  0.352130
7 -0.604516  0.825739  0.123350 -0.549913
8 -0.194991  1.085396 -0.631690  0.400845

## Grouping (그룹화)
> 그룹화는 다음 단계 중 하나 이상을 포함하는 과정이다.
>> 몇몇 기준에 따라 여러 그룹으로 데이터를 분할 (splitting)
>>
>>각 그룹에 독립적으로 함수를 적용 (applying)
>>
>>결과물들을 하나의 데이터 구조로 결합 (combining)
>
> [그룹화](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) 참조

In [76]:
df = pd.DataFrame(
    {'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
     'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
     'C' : np.random.randn(8),
     'D' : np.random.randn(8) })

In [77]:
df

     A      B         C         D
0  foo    one  1.910017  0.292026
1  bar    one -0.341731  0.917777
2  foo    two  0.225297  0.748850
3  bar  three -0.301960  0.565551
4  foo    two -2.187438  0.911670
5  bar    two  0.435335 -0.002757
6  foo    one  1.178677  0.219324
7  foo  three  0.505137 -1.116463

> 데이터프레임을 그룹, sum()

In [78]:
df.groupby('A').sum()

            C         D
A
bar -0.208356  1.480571
foo  1.631690  1.055407

>여러 열을 기준으로 그룹화하면 게층적 인덱스가 형성됨. 여기에도 sum()

In [79]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.341731  0.917777
    three -0.301960  0.565551
    two    0.435335 -0.002757
foo one    3.088693  0.511350
    three  0.505137 -1.116463
    two   -1.962141  1.660520

## Reshaping (변형)
> [계층적 인덱싱](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html) 및 [변형](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html) 참조.
>
### Stack (스택)

In [83]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [82]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [84]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     1.840248  0.914939
      two    -0.651722 -2.630377
baz   one    -0.154929  2.949754
      two    -2.239134  0.886702
foo   one     0.218700  1.487415
      two     0.992835 -1.021009
qux   one     1.258208 -0.457864
      two     1.471935 -0.930050

In [85]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.840248  0.914939
      two    -0.651722 -2.630377
baz   one    -0.154929  2.949754
      two    -2.239134  0.886702

> [stack()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html) 메소드는 데이터프레임 열들의 계층을 “압축”합니다.

In [86]:
stacked = df2.stack()
stacked

first  second
bar    one     A    1.840248
               B    0.914939
       two     A   -0.651722
               B   -2.630377
baz    one     A   -0.154929
               B    2.949754
       two     A   -2.239134
               B    0.886702
dtype: float64

>“Stack된” 데이터프레임 또는 (MultiIndex를 인덱스로 사용하는) Series인 경우,
>
>[stack()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html)의 역 연산은 [unstack()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.unstack.html)이며, 기본적으로 마지막 계층을 unstack합니다.

In [88]:
stacked.unstack()

                     A         B
first second
bar   one     1.840248  0.914939
      two    -0.651722 -2.630377
baz   one    -0.154929  2.949754
      two    -2.239134  0.886702

In [89]:
stacked.unstack(1)

second        one       two
first
bar   A  1.840248 -0.651722
      B  0.914939 -2.630377
baz   A -0.154929 -2.239134
      B  2.949754  0.886702

In [90]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.840248 -0.154929
       B  0.914939  2.949754
two    A -0.651722 -2.239134
       B -2.630377  0.886702

### Pivot Tables (피봇 테이블)
> [피봇 테이블](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html) 부분을 참조하세요.

In [91]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [92]:
df

        A  B    C         D         E
0     one  A  foo -0.657481 -0.100528
1     one  B  foo -0.366097 -1.296748
2     two  C  foo  0.274979 -1.021340
3   three  A  bar -0.179167 -0.710065
4     one  B  bar -0.133844  0.620953
5     one  C  bar  0.334149 -0.950395
6     two  A  foo -0.309167 -0.474913
7   three  B  foo  1.093042 -0.172212
8     one  C  foo -1.133730 -1.118295
9     one  A  bar  1.618047 -0.050025
10    two  B  bar  0.298431  1.575217
11  three  C  bar  0.692146 -1.096965

> pivot table 생성

In [93]:
pd.pivot_table(df, values='D', index=['A','B'], columns='C')

C             bar       foo
A     B
one   A  1.618047 -0.657481
      B -0.133844 -0.366097
      C  0.334149 -1.133730
three A -0.179167       NaN
      B       NaN  1.093042
      C  0.692146       NaN
two   A       NaN -0.309167
      B  0.298431       NaN
      C       NaN  0.274979

## Time Series (시계열) (요건 좀... 모르겠...)
>Pandas는 자주 일어나는 변환 (예시 : 5분마다 일어나는 데이터에 대한 2차 데이터 변환) 사이에 수행하는 리샘플링 연산을 위한 간단하고, 강력하며, 효율적인 함수를 제공합니다.
>
>이는 재무 (금융) 응용에서 매우 일반적이지만 이에 국한되지는 않습니다.
>
>[시계열](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html) 부분을 참고.

In [100]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [101]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [102]:
ts

2012-01-01 00:00:00    322
2012-01-01 00:00:01    180
2012-01-01 00:00:02    120
2012-01-01 00:00:03    108
2012-01-01 00:00:04    332
                      ...
2012-01-01 00:01:35    100
2012-01-01 00:01:36     60
2012-01-01 00:01:37    488
2012-01-01 00:01:38    198
2012-01-01 00:01:39    498
Freq: S, Length: 100, dtype: int32

In [103]:
ts.resample('5Min').sum()

2012-01-01    22806
Freq: 5T, dtype: int32

> 시간대 표현

In [104]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [105]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [106]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [107]:
ts

2012-03-06   -0.629927
2012-03-07   -0.710253
2012-03-08   -1.105220
2012-03-09   -1.472202
2012-03-10    0.915549
Freq: D, dtype: float64

In [109]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00   -0.629927
2012-03-07 00:00:00+00:00   -0.710253
2012-03-08 00:00:00+00:00   -1.105220
2012-03-09 00:00:00+00:00   -1.472202
2012-03-10 00:00:00+00:00    0.915549
Freq: D, dtype: float64

> 다른 시간대 반환

In [110]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.629927
2012-03-06 19:00:00-05:00   -0.710253
2012-03-07 19:00:00-05:00   -1.105220
2012-03-08 19:00:00-05:00   -1.472202
2012-03-09 19:00:00-05:00    0.915549
Freq: D, dtype: float64

> 시간 표현 ↔ 기간 표현으로 변환합니다.

In [111]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [112]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [114]:
ts

2012-01-31    1.219319
2012-02-29   -0.642826
2012-03-31    1.612049
2012-04-30   -0.721893
2012-05-31    0.356002
Freq: M, dtype: float64

In [115]:
ps = ts.to_period()

In [116]:
ps

2012-01    1.219319
2012-02   -0.642826
2012-03    1.612049
2012-04   -0.721893
2012-05    0.356002
Freq: M, dtype: float64

In [117]:
ps.to_timestamp()

2012-01-01    1.219319
2012-02-01   -0.642826
2012-03-01    1.612049
2012-04-01   -0.721893
2012-05-01    0.356002
Freq: MS, dtype: float64

>기간 ↔ 시간 변환은 편리한 산술 기능들을 사용할 수 있도록 만들어줍니다.
>
>다음 예제에서, 우리는 11월에 끝나는 연말 결산의 분기별 빈도를 분기말 익월의 월말일 오전 9시로 변환합니다.

In [118]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [119]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [120]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [121]:
ts.head()

1990-03-01 09:00   -1.525283
1990-06-01 09:00   -0.143013
1990-09-01 09:00    0.756463
1990-12-01 09:00   -0.059669
1991-03-01 09:00   -1.795716
Freq: H, dtype: float64

## Categoricals (범주화)
> **Pandas**는 데이터프레임 내에 범주형 데이터를 포함할 수 있습니다.
>
>[범주형 소개](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html) 와 [API 문서](https://pandas.pydata.org/pandas-docs/stable/reference/index.html) 부분을 참조하세요.